LANGUAGES = ["UA", "RU"]

MESSAGES = {
    "START_MESSAGE": {
        "UA": "Вітаємо вас у ботові, який представляє частину доступних функцій телеграм. Оберіть мову:",
        "RU": "Приветствуем вас в боте, который представляет часть из доступных функций телеграмм. Выберите язык:",
    },\


    "MAIN_MENU": {\
        "UA": "Головне меню",\
        "RU": "Главное меню",\

        "SITE_JOB": {\
            "UA": "Робота з сайтом",
            "RU": "Работа с сайтом",
            "PRESS_TO_FILL_THE_FORM": {
                "UA": "Натисніть кнопку нижче, щоб заповнити форму",
                "RU": "Нажмите на кнопку ниже, и заполните форму",
            },\
            "FILL_THE_FORM": {
                "UA": "Заповнити форму",
                "RU": "Заполнить форму",
            },\
            "YOU_FILLED_THE_FORM": {
                "UA": """Ви успішно заповнили форму.\n\
                        Ваше ім'я: %s\n\
                        Ваше прізвище: %s\n\
                        Ваш вік: %s""",
                "RU": """Вы успешно заполнили форму.\n\
                        Ваше Имя: %s\n\
                        Ваша Фамилия: %s\n\
                        Ваш возвраст: %s"""
            },\
        },\
    },\


    "LANGUAGE": {
        "UA": "Українська",
        "RU": "Русский",
        "CHOSEN_LANGUAGE": {
            "UA": """Обрано <b>Українську</b> мову.\nНатисніть кнопку <b>%s</b>, щоб перейти до головного меню функцій.""",
            "RU": """Выбран язык <b>Русский</b>.\nНажмите кнопку <b>%s</b>, чтобы перейти в головное меню.""",
        },
    },\
}