LANGUAGES = ["UA", "RU"]

MESSAGES = {
    "START_MESSAGE": {
        "UA": "Вітаємо вас у ботові, який представляє частину доступних функцій телеграм. Оберіть мову:",
        "RU": "Приветствуем вас в боте, который представляет часть из доступных функций телеграмм. Выберите язык:",
        "PRESS_START_TO_START": {
            "UA": "Натисність /start, щоб розпочати роботу.",
        }
    },\


    "MAIN_MENU": {\
        "UA": "Головне меню",\
        "RU": "Главное меню",\

        "SITE_JOB": {\
            "UA": "Робота з сайтом",\
            "RU": "Работа с сайтом",\
            "PRESS_TO_FILL_THE_FORM": {\
                "UA": "Натисніть кнопку нижче, щоб заповнити форму",\
                "RU": "Нажмите на кнопку ниже, и заполните форму",\
            },\
            "FILL_THE_FORM": {\
                "UA": "Заповнити форму",\
                "RU": "Заполнить форму",\
            },\
            "YOU_FILLED_THE_FORM": {\
                "UA": """Ви успішно заповнили форму.\n\
                        Ваше ім'я: %s\n\
                        Ваше прізвище: %s\n\
                        Ваш вік: %s""",
                "RU": """Вы успешно заполнили форму.\n\
                        Ваше Имя: %s\n\
                        Ваша Фамилия: %s\n\
                        Ваш возвраст: %s"""
            },\
        },\
        
        "MAILING": {\
            "UA": "Розсилка певним користувачам (або лише вам)",\
            "RU": "Рассылка всем пользователям(или только вам)",\
            "SEND_MESSAGE": {\
                "UA": "Надішліть мені повідомлення, яке хочете надіслати.\nБот може обробляти будь-які повідомлення (файли, фото, відео, геолокацію, контакти тощо).",\
                "RU": "Отправьте мне сообщение, которые вы хотите отправить.\nБот может обрабатывать любые сообщения (файлы, фотографии, видео, геолокацию, контакты и т.д.).",\
            },\
            "SEND_DELAY": {
                "UA": "Надішліть мені час (в секундах 1-60) через який мені надіслати вам повідомлення:",\
                "RU": "Отправьте мне время (в секундах 1-60) через которое мне отправить вам сообщение:",\
            },\
            "SHOW_RESULT": {\
                "UA": "Минуло <b>%s</b> секунд. Ваше повідомлення:",\
                "RU": "Прошло <b>%s</b> секунд. Ваше сообщение:",\
            },\
            "NUM_IS_NOT_VALID": {\
                "UA": "Число не правильне",\
                "RU": "Число не правильное",
            }
        },\
        
        "USER_INFO": {\
            "UA": "Інформація про користувача",\
            "RU": "Информация про пользователя",\
            "ALL_INFO_I_OWE": {\
                "UA": "Вся інформація про вас, яка мені доступна:",\
                "RU": "Вся информация про вас, которая доступна мне:",\
            },\
        },\
        
        "GOOGLE_SHEETS_WORK": {\
            "UA": "Робота з таблицями",\
            "RU": "Работа с таблицами",\
            "SEND_ME_MESSAGE": {\
                "UA": "Напишіть мені будь-яке повідомлення, яке я додам до таблиці Excel.",\
                "RU": "Напишите мне любое сообщение, которое я добавлю в таблицу Excel.",\
            },\
            "I_HAVE_ENTERED_MESSAGE": {
                "UA": "Я вніс це повідомлення до таблиці під номером #%s.\nТаблиця: %s",\
                "RU": "Я внес это сообщение в таблицу под номером #%s.\nТаблица: %s",\
            },\
        },\
        
        "MESSAGE_ANALYSIS": {
            "UA": "Аналіз повідомлення",
            "RU": "Анализ сообщения",
            "SEND_ME_MESSAGE": {
                "UA": "Скиньте мені повідомлення будь-якого типу даних: текст, фото-файл, аудіо-файл, відеофайл, голосове повідомлення, .pdf.",
                "RU": "Скиньте мне сообщение любого типа данных: текст, фото-файл, аудио-файл, видео-файл, голосовое сообщение, .pdf.",
            },
            "YOU_SENT_ME": {
                "UA": "Ви надіслали мені повідомлення типу <b>%s</b>.",
                "RU": "Вы отправили мне сообщения типа <b>%s</b>.",
            },
        },\
        
        "GET_VALUES_FROM_GS": {
            "UA": "Отримати інформацію з ґугл таблиці",
            "RU": "Получить информацию из гугл таблицы",
            "LINK_TO_SPREADSHEET": {
                "UA": "Посилання на гугл таблицю: %s",
                "RU": "Ссылка на гугл таблицу: %s",
            },
        },

        "SPECIAL_ABILITIES": {
            "UA": "Особливі можливості",
            "RU": "Особые возможности",
            "MESSAGES": {
                "MES_0": {
                    "UA": "Я можу ось так",
                    "RU": "Я могу вот так",
                },
                "MES_1": {
                    "UA": "<b>Або ось так</b>",
                    "RU": "<b>Или вот так</b>",
                },
                "MES_2": {
                    "UA": "<i>Ще ось так</i>",
                    "RU": "<i>Еще вот так</i>",
                },
                "MES_3": {
                    "UA": "<s>Навіть ось так</s>",
                    "RU": "<s>Даже вот так</s>",
                },
            },
        },
        
    },\


    "LANGUAGE": {
        "UA": "Українська",
        "RU": "Русский",
        "CHOSEN_LANGUAGE": {
            "UA": """Обрано <b>Українську</b> мову.\nНатисніть кнопку <b>%s</b>, щоб перейти до головного меню функцій.""",
            "RU": """Выбран язык <b>Русский</b>.\nНажмите кнопку <b>%s</b>, чтобы перейти в головное меню.""",
        },
    },\
}